a = input("Число 1:")                     #Введение первого числа
a = int(a)                                #Преобразование в целое число
b = input("Число 2:")                     #Введение второго числа
b = int(b)                                #Преобразование в целое число
print("Cумма чисел",a + b)                #вывести сумму чисел с комментом
print("Разность чисел",a - b)             #вывести разность чисел с комментом
print("Произведение чисел",a * b)         #вывести произведение чисел с коментом